///////////////////////////////////////////////////////////////////////////////////
//        Класс лампы
//
//
//
////////////////////////////////////////////////////////////////////////////////////


//
class Lamp
{
    private:

    public:
    Lamp() //Конструктор по умолчанию (без параметров)
    {
       //LampNumber=LampResurs_St=LampResurs_Set=LampResusr_Res=LampResusr_OSt=0;
    }
    int LampResurs_St;                                 //Ресурсное время лампы    
    int LampResurs_Set;                                //Ручное выставление ресурсного вермени лампы    
    int LampResusr_Res;                                //Сброс отработанного времени на выставленное лампы  
    int LampResusr_OSt;                                //оставшееся время ресурса лампы 
};