///////////////////////////////////////////////////////////////////////////////////
//        Класс лампы
//
//
//
////////////////////////////////////////////////////////////////////////////////////

class Lamp
{
    private:

    public:
    int LampResurs_St;                                 //Ресурсное время лампы 1   
    int LampResurs_Set;                                //Ручное выставление ресурсного вермени лампы 1   
    int LampResusr_Res;                                //Сброс отработанного времени на выставленное лампы 1 
    int LampResusr_OSt;                                //оставшееся время ресурса лампы 1
};